{"posts": {"News: Attack on NSUI activists by TMC": "Another attack on our chattra parishad (NSUI) activists, Adv. Anchar Uddin by TMC goons, they assualted and beaten his family members and vandalised everything in his home.\r\n\r\nThe family of victim is now homeless, they said that they are afraid to go to police station because **there is no law and order in West Bengal**", "News: 'Complete breakdown of law and order in Bengal,' BJP moves Supreme Court seeking CBI probe": "**New Delhi:** Two days after the results of assembly elections in West Bengal, the BJP on Tuesday (May 4) moved the Supreme Court Court seeking a CBI probe into the alleged attacks on its party workers and offices by the TMC workers.\r\n\r\nBJP spokesperson Gaurav Bhatia filed a petition saying there was a complete breakdown of the law and order machinery in the state.\r\n\r\n“The instant application has been preferred by the petitioner to bring to the notice of this court the brutal murders and commission of serious crimes like rape and molestation, blatant violence and the complete breakdown of the law and order machinery in the state of West Bengal, during and after the recently concluded Assembly elections,” the plea said, according to IANS.\r\n\r\nThe development comes after Mamata Banerjee-led TMC posted a massive win over the BJP in the recently concluded assembly elections.\r\n\r\nBhatia alleged that the violence is directly sponsored by the TMC whose workers were seeking revenge against the people who supported the BJP in the election.\r\n\r\nThe BJP leader also cited the 'murder' of one Avijit Sarkar in Kolkata, stating that it was 'proof enough to highlight as to how there is a great dance of democracy that is currently underway in West Bengal under the protection of Trinamool Congress'.\r\n\r\n'Sarkar in a video uploaded on Facebook moments before his death highlighted how the Trinamool workers not only ransacked his house and NGO, but also mercilessly killed voiceless puppies. Sarkar specifically blamed the Trinamool leaders for the attack and eventual death, ' the plea said.\r\n\r\n**'The Trinamool has dehumanised its political opponents, specifically targeting the BJP and its members and workers, branding them as fascists and bigots,'** it added.\r\n\r\nThe petition urged the apex court to pass an order directing the CBI to launch an enquiry and investigate the instances of ** 'rampant violence, murders and rape'** that have been carried out by the workers of Trinamool across the state ';.\r\n\r\nIt also sought directions to the West Bengal government to file a detailed status report with respect to the FIRs registered, arrests made, and steps taken by it.\r\n\r\nMeanwhile, the TMC leaders have alleged that the violence in the state was as a result of infighting within the BJP camp.\r\n\r\nBJP IT cell could have given trolls some time off after results. All cases on SM are BJP intra-party fights. Three+ factions in Bengal. They hate each other. MO-SHA came here and spread hate for the last four months. Bengal wants peace and harmony. BJP wants divisiveness: TMC MP Derek O'Brien tweeted."}}